DrPool16/Proyecto_Acuicultura_NXP_SERVER_MQTT/Micro_nxp/Prueba_MQTT_V1/K32L2B31A_Project/K32L2B31A_Project/board/pin_mux.h
/*! @name PORTE20 (number 9), J4[1]/DIFF_ADC0_DP/LCD_P59
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_BIN_DS18B20_BIN_5_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_BIN_DS18B20_BIN_5_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_BIN_DS18B20_BIN_5_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTE22 (number 11), J4[5]/DIFF_ADC1_DP
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_BIN_DS18B20_BIN_6_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_BIN_DS18B20_BIN_6_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_BIN_DS18B20_BIN_6_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTB2 (number 37), J4[6]/A2/LCD_P2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_BIN_DS18B20_BIN_7_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_BIN_DS18B20_BIN_7_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_BIN_DS18B20_BIN_7_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTB1 (number 36), J4[4]/A1/LCD_P1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_BIN_DS18B20_BIN_8_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_BIN_DS18B20_BIN_8_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_BIN_DS18B20_BIN_8_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_BIN_DS18B20(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_BM280(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC_BMP280_Pins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
